fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПревышениеОтпуска</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьУсловноеОформление();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
    ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
    Если ТекущиеДанные <> Неопределено Тогда
        ТекущиеДанные.КоличествоДней = КоличествоКалендарныхДней(
            ТекущиеДанные.ДатаНачала, 
            ТекущиеДанные.ДатаОкончания);
    КонецЕсли;
    ОбновитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
    ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
    Если ТекущиеДанные <> Неопределено Тогда
        ТекущиеДанные.КоличествоДней = КоличествоКалендарныхДней(
            ТекущиеДанные.ДатаНачала, 
            ТекущиеДанные.ДатаОкончания);
    КонецЕсли;
    ОбновитьУсловноеОформление();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	АдресДанных = ПоместитьДанныеВХранилище();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДанных", АдресДанных);
	ПараметрыФормы.Вставить("Год", Объект.Год);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", 
	             ПараметрыФормы, 
	             ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьДанныеВХранилище()
	
	ТаблицаДанных = Объект.ОтпускаСотрудников.Выгрузить(, "Сотрудник, ДатаНачала, ДатаОкончания, КоличествоДней");
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаДанных, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Функция КоличествоКалендарныхДней(ДатаНачала, ДатаОкончания)
    Если Не ЗначениеЗаполнено(ДатаНачала) Или Не ЗначениеЗаполнено(ДатаОкончания) Тогда
        Возврат 0;
    КонецЕсли;

    Если ДатаОкончания < ДатаНачала Тогда
        Возврат 0;
    КонецЕсли;

    Возврат Окр((КонецДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / 86400, 2);
КонецФункции

&НаСервере
Процедура ОбновитьУсловноеОформление()
    
    РассчитатьПревышениеОтпуска();
    
    МассивУдаляемых = Новый Массив;
    Для Каждого ЭлементОформления Из УсловноеОформление.Элементы Цикл
        Если ЭлементОформления.ИдентификаторПользовательскойНастройки = "ВКМ_ОтпускБольше28Дней" Тогда
            МассивУдаляемых.Добавить(ЭлементОформления);
        КонецЕсли;
    КонецЦикла;
    
    Для Каждого Эл Из МассивУдаляемых Цикл
        УсловноеОформление.Элементы.Удалить(Эл);
    КонецЦикла;
    
    Элемент = УсловноеОформление.Элементы.Добавить();
    Элемент.ИдентификаторПользовательскойНастройки = "ВКМ_ОтпускБольше28Дней";
    
    Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоКоралловый);
    
    ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.ПревышениеОтпуска");
    ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
    ОтборЭлемента.ПравоеЗначение = Истина;
    ОтборЭлемента.Использование  = Истина;
    
    ОформляемоеПоле = Элемент.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");
    ОформляемоеПоле.Использование = Истина;
    
КонецПроцедуры

&НаСервере
Процедура РассчитатьПревышениеОтпуска()
    
    Для Каждого СтрокаТЧ Из Объект.ОтпускаСотрудников Цикл
        СтрокаТЧ.ПревышениеОтпуска = Ложь;
    КонецЦикла;
    
    СоответствиеСумм = Новый Соответствие;
    
    Для Каждого СтрокаТЧ Из Объект.ОтпускаСотрудников Цикл
        Если Не ЗначениеЗаполнено(СтрокаТЧ.Сотрудник) Тогда
            Продолжить;
        КонецЕсли;
        
        ТекущаяСумма = СоответствиеСумм.Получить(СтрокаТЧ.Сотрудник);
        Если ТекущаяСумма = Неопределено Тогда
            ТекущаяСумма = 0;
        КонецЕсли;
        
        СоответствиеСумм.Вставить(СтрокаТЧ.Сотрудник, ТекущаяСумма + СтрокаТЧ.КоличествоДней);
    КонецЦикла;
    
    Для Каждого СтрокаТЧ Из Объект.ОтпускаСотрудников Цикл
        Если Не ЗначениеЗаполнено(СтрокаТЧ.Сотрудник) Тогда
            Продолжить;
        КонецЕсли;
        
        СуммаПоСотруднику = СоответствиеСумм.Получить(СтрокаТЧ.Сотрудник);
        Если СуммаПоСотруднику > 28 Тогда
            СтрокаТЧ.ПревышениеОтпуска = Истина;
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти
